Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS406.h
#define _LEBDLY4_LEB7_POSITION                   0x0000000A
#define _LEBDLY4_LEB7_MASK                       0x00000400
#define _LEBDLY4_LEB7_LENGTH                     0x00000001

#define _LEBDLY4_LEB8_POSITION                   0x0000000B
#define _LEBDLY4_LEB8_MASK                       0x00000800
#define _LEBDLY4_LEB8_LENGTH                     0x00000001

#define _AUXCON4_CHOPLEN_POSITION                0x00000000
#define _AUXCON4_CHOPLEN_MASK                    0x00000001
#define _AUXCON4_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON4_CHOPHEN_POSITION                0x00000001
#define _AUXCON4_CHOPHEN_MASK                    0x00000002
#define _AUXCON4_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON4_CHOPSEL_POSITION                0x00000002
#define _AUXCON4_CHOPSEL_MASK                    0x0000003C
#define _AUXCON4_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON4_BLANKSEL_POSITION               0x00000008
#define _AUXCON4_BLANKSEL_MASK                   0x00000F00
#define _AUXCON4_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON4_HRDDIS_POSITION                 0x0000000E
#define _AUXCON4_HRDDIS_MASK                     0x00004000
#define _AUXCON4_HRDDIS_LENGTH                   0x00000001

#define _AUXCON4_HRPDIS_POSITION                 0x0000000F
#define _AUXCON4_HRPDIS_MASK                     0x00008000
#define _AUXCON4_HRPDIS_LENGTH                   0x00000001

#define _AUXCON4_CHOPSEL0_POSITION               0x00000002
#define _AUXCON4_CHOPSEL0_MASK                   0x00000004
#define _AUXCON4_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON4_CHOPSEL1_POSITION               0x00000003
#define _AUXCON4_CHOPSEL1_MASK                   0x00000008
#define _AUXCON4_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON4_CHOPSEL2_POSITION               0x00000004
#define _AUXCON4_CHOPSEL2_MASK                   0x00000010
#define _AUXCON4_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON4_CHOPSEL3_POSITION               0x00000005
#define _AUXCON4_CHOPSEL3_MASK                   0x00000020
#define _AUXCON4_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON4_BLANKSEL0_POSITION              0x00000008
#define _AUXCON4_BLANKSEL0_MASK                  0x00000100
#define _AUXCON4_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON4_BLANKSEL1_POSITION              0x00000009
#define _AUXCON4_BLANKSEL1_MASK                  0x00000200
#define _AUXCON4_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON4_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON4_BLANKSEL2_MASK                  0x00000400
#define _AUXCON4_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON4_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON4_BLANKSEL3_MASK                  0x00000800
#define _AUXCON4_BLANKSEL3_LENGTH                0x00000001

#define _PWMCON5_IUE_POSITION                    0x00000000
#define _PWMCON5_IUE_MASK                        0x00000001
#define _PWMCON5_IUE_LENGTH                      0x00000001

#define _PWMCON5_XPRES_POSITION                  0x00000001
#define _PWMCON5_XPRES_MASK                      0x00000002
#define _PWMCON5_XPRES_LENGTH                    0x00000001

#define _PWMCON5_CAM_POSITION                    0x00000002
#define _PWMCON5_CAM_MASK                        0x00000004
#define _PWMCON5_CAM_LENGTH                      0x00000001

#define _PWMCON5_MTBS_POSITION                   0x00000003
#define _PWMCON5_MTBS_MASK                       0x00000008
#define _PWMCON5_MTBS_LENGTH                     0x00000001

#define _PWMCON5_DTCP_POSITION                   0x00000005
#define _PWMCON5_DTCP_MASK                       0x00000020
#define _PWMCON5_DTCP_LENGTH                     0x00000001

#define _PWMCON5_DTC_POSITION                    0x00000006
#define _PWMCON5_DTC_MASK                        0x000000C0
#define _PWMCON5_DTC_LENGTH                      0x00000002

#define _PWMCON5_MDCS_POSITION                   0x00000008
#define _PWMCON5_MDCS_MASK                       0x00000100
#define _PWMCON5_MDCS_LENGTH                     0x00000001

#define _PWMCON5_ITB_POSITION                    0x00000009
#define _PWMCON5_ITB_MASK                        0x00000200
#define _PWMCON5_ITB_LENGTH                      0x00000001

#define _PWMCON5_TRGIEN_POSITION                 0x0000000A
#define _PWMCON5_TRGIEN_MASK                     0x00000400
#define _PWMCON5_TRGIEN_LENGTH                   0x00000001

#define _PWMCON5_CLIEN_POSITION                  0x0000000B
#define _PWMCON5_CLIEN_MASK                      0x00000800
#define _PWMCON5_CLIEN_LENGTH                    0x00000001

#define _PWMCON5_FLTIEN_POSITION                 0x0000000C
#define _PWMCON5_FLTIEN_MASK                     0x00001000
#define _PWMCON5_FLTIEN_LENGTH                   0x00000001

#define _PWMCON5_TRGSTAT_POSITION                0x0000000D
#define _PWMCON5_TRGSTAT_MASK                    0x00002000
#define _PWMCON5_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON5_CLSTAT_POSITION                 0x0000000E
#define _PWMCON5_CLSTAT_MASK                     0x00004000
#define _PWMCON5_CLSTAT_LENGTH                   0x00000001

#define _PWMCON5_FLTSTAT_POSITION                0x0000000F
#define _PWMCON5_FLTSTAT_MASK                    0x00008000
#define _PWMCON5_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON5_DTC0_POSITION                   0x00000006
#define _PWMCON5_DTC0_MASK                       0x00000040
#define _PWMCON5_DTC0_LENGTH                     0x00000001

#define _PWMCON5_DTC1_POSITION                   0x00000007
#define _PWMCON5_DTC1_MASK                       0x00000080
#define _PWMCON5_DTC1_LENGTH                     0x00000001

#define _IOCON5_OSYNC_POSITION                   0x00000000
#define _IOCON5_OSYNC_MASK                       0x00000001
#define _IOCON5_OSYNC_LENGTH                     0x00000001

#define _IOCON5_SWAP_POSITION                    0x00000001
#define _IOCON5_SWAP_MASK                        0x00000002
#define _IOCON5_SWAP_LENGTH                      0x00000001

#define _IOCON5_CLDAT_POSITION                   0x00000002
#define _IOCON5_CLDAT_MASK                       0x0000000C
#define _IOCON5_CLDAT_LENGTH                     0x00000002

#define _IOCON5_FLTDAT_POSITION                  0x00000004
#define _IOCON5_FLTDAT_MASK                      0x00000030
#define _IOCON5_FLTDAT_LENGTH                    0x00000002

#define _IOCON5_OVRDAT_POSITION                  0x00000006
#define _IOCON5_OVRDAT_MASK                      0x000000C0
#define _IOCON5_OVRDAT_LENGTH                    0x00000002

#define _IOCON5_OVRENL_POSITION                  0x00000008
#define _IOCON5_OVRENL_MASK                      0x00000100
#define _IOCON5_OVRENL_LENGTH                    0x00000001

