Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS406.h
#define _LEBDLY6_LEB7_POSITION                   0x0000000A
#define _LEBDLY6_LEB7_MASK                       0x00000400
#define _LEBDLY6_LEB7_LENGTH                     0x00000001

#define _LEBDLY6_LEB8_POSITION                   0x0000000B
#define _LEBDLY6_LEB8_MASK                       0x00000800
#define _LEBDLY6_LEB8_LENGTH                     0x00000001

#define _AUXCON6_CHOPLEN_POSITION                0x00000000
#define _AUXCON6_CHOPLEN_MASK                    0x00000001
#define _AUXCON6_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPHEN_POSITION                0x00000001
#define _AUXCON6_CHOPHEN_MASK                    0x00000002
#define _AUXCON6_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPSEL_POSITION                0x00000002
#define _AUXCON6_CHOPSEL_MASK                    0x0000003C
#define _AUXCON6_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON6_BLANKSEL_POSITION               0x00000008
#define _AUXCON6_BLANKSEL_MASK                   0x00000F00
#define _AUXCON6_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON6_HRDDIS_POSITION                 0x0000000E
#define _AUXCON6_HRDDIS_MASK                     0x00004000
#define _AUXCON6_HRDDIS_LENGTH                   0x00000001

#define _AUXCON6_HRPDIS_POSITION                 0x0000000F
#define _AUXCON6_HRPDIS_MASK                     0x00008000
#define _AUXCON6_HRPDIS_LENGTH                   0x00000001

#define _AUXCON6_CHOPSEL0_POSITION               0x00000002
#define _AUXCON6_CHOPSEL0_MASK                   0x00000004
#define _AUXCON6_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL1_POSITION               0x00000003
#define _AUXCON6_CHOPSEL1_MASK                   0x00000008
#define _AUXCON6_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL2_POSITION               0x00000004
#define _AUXCON6_CHOPSEL2_MASK                   0x00000010
#define _AUXCON6_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL3_POSITION               0x00000005
#define _AUXCON6_CHOPSEL3_MASK                   0x00000020
#define _AUXCON6_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON6_BLANKSEL0_POSITION              0x00000008
#define _AUXCON6_BLANKSEL0_MASK                  0x00000100
#define _AUXCON6_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL1_POSITION              0x00000009
#define _AUXCON6_BLANKSEL1_MASK                  0x00000200
#define _AUXCON6_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON6_BLANKSEL2_MASK                  0x00000400
#define _AUXCON6_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON6_BLANKSEL3_MASK                  0x00000800
#define _AUXCON6_BLANKSEL3_LENGTH                0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_SWDTEN_POSITION                    0x00000005
#define _RCON_SWDTEN_MASK                        0x00000020
#define _RCON_SWDTEN_LENGTH                      0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_VREGS_POSITION                     0x00000008
#define _RCON_VREGS_MASK                         0x00000100
#define _RCON_VREGS_LENGTH                       0x00000001

#define _RCON_IOPUWR_POSITION                    0x0000000E
#define _RCON_IOPUWR_MASK                        0x00004000
#define _RCON_IOPUWR_LENGTH                      0x00000001

#define _RCON_TRAPR_POSITION                     0x0000000F
#define _RCON_TRAPR_MASK                         0x00008000
#define _RCON_TRAPR_LENGTH                       0x00000001

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_LPOSCEN_POSITION                 0x00000001
#define _OSCCON_LPOSCEN_MASK                     0x00000002
#define _OSCCON_LPOSCEN_LENGTH                   0x00000001

#define _OSCCON_CF_POSITION                      0x00000003
#define _OSCCON_CF_MASK                          0x00000008
#define _OSCCON_CF_LENGTH                        0x00000001

#define _OSCCON_PRCDEN_POSITION                  0x00000004
#define _OSCCON_PRCDEN_MASK                      0x00000010
#define _OSCCON_PRCDEN_LENGTH                    0x00000001

#define _OSCCON_LOCK_POSITION                    0x00000005
#define _OSCCON_LOCK_MASK                        0x00000020
#define _OSCCON_LOCK_LENGTH                      0x00000001

#define _OSCCON_CLKLOCK_POSITION                 0x00000007
#define _OSCCON_CLKLOCK_MASK                     0x00000080
#define _OSCCON_CLKLOCK_LENGTH                   0x00000001

#define _OSCCON_NOSC_POSITION                    0x00000008
#define _OSCCON_NOSC_MASK                        0x00000700
#define _OSCCON_NOSC_LENGTH                      0x00000003

#define _OSCCON_COSC_POSITION                    0x0000000C
#define _OSCCON_COSC_MASK                        0x00007000
#define _OSCCON_COSC_LENGTH                      0x00000003

